[
    {
        "title": "Mercedes EQC recalled for possible steering failure",
        "viewers": "826",
        "details": "Mercedes-Benz issued a recall for the first member of the EQ family, the EQC electric SUV. The carmaker points out that a power steering failure could suddenly rising, thus increasing the risk of an accident. No such incident has yet been reported, but the company is getting ready to start the prevention move.",
        "img": "https://i.ibb.co/QkDpKr6/1.jpg"
    },
    {
        "title": "1936 Mercedes-Benz 540K Cabriolet C",
        "viewers": "675",
        "details": "The Mercedes-Benz 540K was the ultimate pre-War Mercedes road car, the Kidston website notes, following the recent sale for an undisclosed amount.  Luxurious, extravagant, expensive, it was everything a state leader would want.",
        "img": "https://i.ibb.co/wJM4d2N/2.jpg"
    },
    {
        "title": "Fiber-carbonized by Larte Design",
        "viewers": "105",
        "details": "The “Winner” bodykit brings lots and lots of carbon fiber. It is just about everywhere you think or not think might be appropriate. The tuning house with headquarters in the United States, Germany and Russia, fits the Mercedes-AMG GLS 63 with the new options.",
        "img": "https://i.ibb.co/t3CHLbv/3.jpg"
    },
    {
        "title": "Matt Watson from carwow drove in parallel on the track the new Mercedes EQS 450+",
        "viewers": "963",
        "details": "At first glance this confrontation seems unbalanced. The Mercedes S 500 has a e 6-cylinder inline 3 liter turbo engine that develops 435 HP and 520 Nm and weighs 2065 kg. Power is transmitted to all four wheels via a 9-speed automatic transmission.",
        "img": "https://i.ibb.co/sshvmRz/4.jpg"
    },
    {
        "title": "Tesla celebrates opening of Milan store on Feb. 11",
        "viewers": "822",
        "details": "February 1, 2011 MILAN - Electric vehicle manufacturer Tesla Motors (NASDAQ:TSLA) is celebrating the opening of its first showroom in Italy on February 11 with a VIP gala in the capital of haute couture.",
        "img": "https://i.ibb.co/F7W4pmw/5.jpg"
    },
    {
        "title": "BMWBLOG Podcast EP.58: M4 xDrive and B8 Gran Coupe test drives",
        "viewers": "762",
        "details": "Well, we’re back. The BMWBLOG Podcast took a break for a little while, as Horatiu and I were both extremely busy with trips and test drives that we couldn’t record any episodes. However, now that life has slowed down a bit, we’re back with another episode and it’s one worth listening to.",
        "img": "https://i.ibb.co/VwBJfcd/6.jpg"
    },
    {
        "title": "Rolls-Royce Wraith Dimensions",
        "viewers": "462",
        "details": "The new Rolls-Royce Wraith dimensions help create a spacious, more comfortable drive no matter how long you’re in the vehicle. Explore the 2021 Rolls-Royce Wraith interior dimensions, features, and more with us at Rolls-Royce Motor Cars Pasadena to fully experience the spaciousness and luxuriousness of the new Rolls-Royce Wraith interior.",
        "img": "https://i.ibb.co/VY3YFtZ/7.jpg"
    }

]